742117806/AI_Board_STM32F103C8T6/程序备份/AI_扩展板MCU固件程序(470M定频20通道)/STM32F103C8T6/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include "taskApp.h"
#include "delay.h"
#include "user_call_back.h"
#include "wireless_app.h"
#include "wireless_drv.h"
#include "uart.h"
#include "stmflash.h"
#include "led.h"
#include "frame_process.h"
#include "stm32f0_eeprom.h"
#include "aes.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint8_t uart1_rec;
uint8_t uart2_rec;

//串口接收一帧数据后处理
void UartRcvTask(void)
{
    uint16_t len, t;
    if (USART2_RX_STA & 0x8000)
    {
        len = USART2_RX_STA & 0x3fff; //得到此次接收到的数据长度
        //printf("\r\n您发送的消息为:\r\n\r\n");
        for (t = 0; t < len; t++)
        {
            UartSendData(USART2, USART2_RX_BUF[t]); //向串口1发送数据
        }

        //printf("\r\n\r\n");//插入换行
        USART2_RX_STA = 0;
    }
    if (USART_RX_STA & 0x8000)
    {
        len = USART_RX_STA & 0x3fff; //得到此次接收到的数据长度
        //printf("\r\n您发送的消息为:\r\n\r\n");
        for (t = 0; t < len; t++)
        {
            UartSendData(USART1, USART_RX_BUF[t]); //向串口1发送数据
        }
        Si4438_Transmit_Start(&Wireless_Buf, 10, USART_RX_BUF, len);
        //printf("\r\n\r\n");//插入换行
        USART_RX_STA = 0;
    }
}

/*
无线数据处理任务
*/
void WirelessTask(void)
{
    uint8_t recFlag = 0;
    if (WIRELESS_STATUS == Wireless_RX_Finish)
    {
        Uart1SendBytes(Wireless_Buf.Wireless_RxData, Wireless_Buf.Wireless_PacketLength);
        recFlag = 1;
        //Si4438_Receive_Start(Wireless_Channel[0]);
    }
    if (WIRELESS_STATUS == Wireless_TX_Finish)
    {
        DEBUG_Printf("Wireless_TX_Finish\r\n");
        Si4438_Receive_Start(Wireless_Channel[0]); //开始接收无线数据
    }
    else if (WIRELESS_STATUS == Wireless_RX_Failure)
    {
        WirelessRx_Timeout_Cnt = 0;
        DEBUG_Printf("Wireless_RX_Failure\r\n");
        delay_ms(30);
        Set_Property(Interrupt_Close);
        delay_ms(200);
        Si4438_Receive_Start(Wireless_Channel[0]); //开始接收无线数据
    }
//    else if ((WIRELESS_STATUS == Wireless_RX_Sync) && (WirelessRx_Timeout_Cnt > 500)) //500ms超时
//    {

//        DEBUG_Printf("Wireless_RX_Sync\r\n");
//        delay_ms(30);
//        Set_Property(Interrupt_Close);
//        delay_ms(200);
//        Si4438_Receive_Start(Wireless_Channel[0]); //开始接收无线数据
//        WirelessRx_Timeout_Cnt = 0;
//    }

    if (recFlag == 1)
    {
        Si4438_Transmit_Start(&Wireless_Buf, 22, "abcdefg", 7);
    }
}

//根据家庭组切换到新的固定通讯频道上
#ifdef Use_Rx_Hop
void Get_WireLessChannel(uint8_t *wire_chnel)
{
   uint32_t temp_val = LANGroup_Addr[0] + LANGroup_Addr[1] + LANGroup_Addr[2];
	
   //uint32_t temp_val = 0x00 + 0x29 + 0x02;
   //uint32_t temp_val = 0x00 + 0x2A + 0x5B;
    if (temp_val == 0)
    {
        wire_chnel[0] = Default_Channel;
        wire_chnel[1] = Default_Channel;
    }
    else
    {
        wire_chnel[0] = (temp_val & 0x1f) << 1; //共32个信道组，每个信道组有两个信道
        wire_chnel[1] = wire_chnel[0] + 1;
		if(wire_chnel[0] == Default_Channel)
		{
			wire_chnel[0] = wire_chnel[0] + 2;
			wire_chnel[1] = wire_chnel[0] + 1;
		} 
    }

	
  
    RF_RX_HOP_CONTROL_12[7] = Channel_Frequency_Index[wire_chnel[0]]; //放入群组的主频道
    RF_RX_HOP_CONTROL_12[8] = Channel_Frequency_Index[wire_chnel[1]]; //放入群组的备用频道
}
#else
void Get_WireLessChannel(uint8_t *wire_chnel)
{
	wire_chnel[0] = Default_Channel;
	wire_chnel[1] = Default_Channel;
}
#endif
//LED旋转灯测试
void PowerOn_Led(void)
{
    //Fashion_ParaBuf.Led4_CotrolPara = 0x43;
    //LED_SetALed(4, Purple, 63);
    LED_SetDuty(Purple, 63);
    LED_SetALed(4, Purple, 63);
    SysDelay_Xms(2000);

